results/2026-05-28/benchmark_pgsql_20260528_011924.txt
========================================
Sysbench Benchmark Suite
Driver: pgsql
Tables: 4 x 10000 rows
Threads: 4, Time: 10s
Script start: Thu May 28 01:19:24 AM CEST 2026
========================================
Benchmarks start: Thu May 28 01:19:24 AM CEST 2026
========================================

--- oltp_point_select ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            429737
        write:                           0
        other:                           0
        total:                           429737
    transactions:                        429737 (42959.51 per sec.)
    queries:                             429737 (42959.51 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      42959.5141
    time elapsed:                        10.0033s
    total number of events:              429737

Latency (ms):
         min:                                    0.06
         avg:                                    0.09
         max:                                    6.33
         95th percentile:                        0.13
         sum:                                39808.29

Threads fairness:
    events (avg/stddev):           107434.2500/587.85
    execution time (avg/stddev):   9.9521/0.00


--- oltp_read_only ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            314146
        write:                           0
        other:                           44878
        total:                           359024
    transactions:                        22439  (2243.08 per sec.)
    queries:                             359024 (35889.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2243.0797
    time elapsed:                        10.0037s
    total number of events:              22439

Latency (ms):
         min:                                    1.19
         avg:                                    1.78
         max:                                    8.77
         95th percentile:                        2.35
         sum:                                39974.33

Threads fairness:
    events (avg/stddev):           5609.7500/35.10
    execution time (avg/stddev):   9.9936/0.00


--- oltp_read_write ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            112182
        write:                           32051
        other:                           16027
        total:                           160260
    transactions:                        8013   (800.89 per sec.)
    queries:                             160260 (16017.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      800.8888
    time elapsed:                        10.0051s
    total number of events:              8013

Latency (ms):
         min:                                    3.53
         avg:                                    4.99
         max:                                   23.52
         95th percentile:                        7.17
         sum:                                39993.55

Threads fairness:
    events (avg/stddev):           2003.2500/5.21
    execution time (avg/stddev):   9.9984/0.00


--- oltp_insert ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           11439
        other:                           0
        total:                           11439
    transactions:                        11439  (1143.55 per sec.)
    queries:                             11439  (1143.55 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1143.5479
    time elapsed:                        10.0031s
    total number of events:              11439

Latency (ms):
         min:                                    2.45
         avg:                                    3.49
         max:                                   15.02
         95th percentile:                        4.49
         sum:                                39969.20

Threads fairness:
    events (avg/stddev):           2859.7500/0.43
    execution time (avg/stddev):   9.9923/0.00


--- oltp_delete ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           11200
        other:                           1935
        total:                           13135
    transactions:                        13135  (1313.18 per sec.)
    queries:                             13135  (1313.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1313.1840
    time elapsed:                        10.0024s
    total number of events:              13135

Latency (ms):
         min:                                    0.10
         avg:                                    3.04
         max:                                   10.48
         95th percentile:                        4.57
         sum:                                39987.09

Threads fairness:
    events (avg/stddev):           3283.7500/25.25
    execution time (avg/stddev):   9.9968/0.00


--- oltp_update_index ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           11227
        other:                           0
        total:                           11227
    transactions:                        11227  (1122.32 per sec.)
    queries:                             11227  (1122.32 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1122.3158
    time elapsed:                        10.0034s
    total number of events:              11227

Latency (ms):
         min:                                    2.56
         avg:                                    3.56
         max:                                   38.85
         95th percentile:                        4.91
         sum:                                39986.82

Threads fairness:
    events (avg/stddev):           2806.7500/0.43
    execution time (avg/stddev):   9.9967/0.00


--- oltp_update_non_index ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           5245
        other:                           0
        total:                           5245
    transactions:                        5245   (524.06 per sec.)
    queries:                             5245   (524.06 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      524.0619
    time elapsed:                        10.0084s
    total number of events:              5245

Latency (ms):
         min:                                    2.79
         avg:                                    7.63
         max:                                   49.50
         95th percentile:                       12.98
         sum:                                40006.94

Threads fairness:
    events (avg/stddev):           1311.2500/0.43
    execution time (avg/stddev):   10.0017/0.00


--- select_random_points ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            294910
        write:                           0
        other:                           0
        total:                           294910
    transactions:                        294910 (29481.69 per sec.)
    queries:                             294910 (29481.69 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      29481.6858
    time elapsed:                        10.0032s
    total number of events:              294910

Latency (ms):
         min:                                    0.08
         avg:                                    0.13
         max:                                   11.06
         95th percentile:                        0.21
         sum:                                39727.58

Threads fairness:
    events (avg/stddev):           73727.5000/367.73
    execution time (avg/stddev):   9.9319/0.00


--- select_random_ranges ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            209774
        write:                           0
        other:                           0
        total:                           209774
    transactions:                        209774 (20968.44 per sec.)
    queries:                             209774 (20968.44 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      20968.4366
    time elapsed:                        10.0043s
    total number of events:              209774

Latency (ms):
         min:                                    0.11
         avg:                                    0.19
         max:                                   23.75
         95th percentile:                        0.27
         sum:                                39769.76

Threads fairness:
    events (avg/stddev):           52443.5000/241.98
    execution time (avg/stddev):   9.9424/0.01


--- bulk_insert ---
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           4
        other:                           0
        total:                           4
    transactions:                        10000  (123687.06 per sec.)
    queries:                             4      (49.47 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      123687.0649
    time elapsed:                        0.0808s
    total number of events:              10000

Latency (ms):
         min:                                    0.00
         avg:                                    0.01
         max:                                   19.52
         95th percentile:                        0.00
         sum:                                   76.03

Threads fairness:
    events (avg/stddev):           2500.0000/1919.91
    execution time (avg/stddev):   0.0190/0.00


========================================
Script start:     2026-05-28 01:19:24
Benchmarks start: 2026-05-28 01:19:24
Script end:       2026-05-28 01:21:00
Prep time:        0s
Benchmark time:   96s
Total time:       96s
Results saved to: benchmark_pgsql_20260528_011924.txt
========================================